{"id":1,"name":"The Legend of Zelda: Breath of The Wild","age":"12","genre":"Action-Adventure","review":"5/5","price":"£59.99","description":"Forget everything you know about The Legend of Zelda games. Step into a world of discovery, exploration, and adventure in The Legend of Zelda: Breath of the Wild, a boundary-breaking new game in the acclaimed series. Travel across vast fields, through forests, and to mountain peaks as you discover what has become of the kingdom of Hyrule in this stunning Open-Air Adventure. Now on Nintendo Switch, your journey is freer and more open than ever. Take your system anywhere, and adventure as Link any way you like."}
{"id":2,"name":"Animal Crossing: New Horizons","age":"3","genre":"Survival/Casual","review":"5/5","price":"£59.99","description":"Escape to a deserted island and create your own paradise as you explore, create, and customize in the Animal Crossing: New Horizons game. Your island getaway has a wealth of natural resources that can be used to craft everything from tools to creature comforts. You can hunt down insects at the crack of dawn, decorate your paradise throughout the day, or enjoy sunset on the beach while fishing in the ocean. The time of day and season match real life, so each day on your island is a chance to check in and find new surprises all year round."}
{"id":3,"name":"Smash Bros: Ultimate","age":"12","genre":"Fighter","review":"5/5","price":"£59.99","description":"Gaming icons clash in the ultimate brawl you can play anytime, anywhere! Smash rivals off the stage as new characters Simon Belmont and King K. Rool join Inkling, Ridley, and every fighter in Super Smash Bros. history. Enjoy enhanced speed and combat at new stages based on the Castlevania series, Super Mario Odyssey, and more!"}
{"id":4,"name":"Splatoon 2","age":"7","genre":"Shooter","review":"4.1/5","price":"£41.99","description":"The squid kids called Inklings are back to splat more ink and claim more turf in this colorful and chaotic 4-on-4 action shooter. For the first time, take Turf War battles on-the-go with the Nintendo Switch™ system, and use any of the console’s portable play styles for intense local multiplayer* action. Even team up for new 4-player co-op fun in Salmon Run!"}
{"id":5,"name":"Pokemon Sword","age":"7","genre":"Pet Battle","review":"4/5","price":"£59.99","description":"A new generation of Pokémon is coming to the Nintendo Switch™ system. Begin your adventure as a Pokémon Trainer by choosing one of three new partner Pokémon: Grookey, Scorbunny, or Sobble. Then embark on a journey in the new Galar region, where you’ll challenge the troublemakers of Team Yell, while unraveling the mystery behind the Legendary Pokémon Zacian and Zamazenta! Explore the Wild Area, a vast expanse of land where the player can freely control the camera. Team up with three other players locally or online in the new multiplayer co-op Max Raid Battles* in which players will face off against gigantic and super-strong Pokémon known as Dynamax Pokémon."}
{"id":6,"name":"Mario Kart 8: Deluxe","age":"3","genre":"Racing","review":"4/5","price":"£59.99","description":"Hit the road with the definitive version of Mario Kart 8 and play anytime, anywhere! Race your friends or battle them in a revised battle mode on new and returning battle courses. Play locally in up to 4-player multiplayer in 1080p while playing in TV Mode. Every track from the Wii U version, including DLC, makes a glorious return. Plus, the Inklings appear as all-new guest characters, along with returning favorites, such as King Boo, Dry Bones, and Bowser Jr.!"}
{"id":7,"name":"Super Mario Odyssey","age":"7","genre":"Adventure","review":"5/5","price":"£59.99","description":"Join Mario on a massive, globe-trotting 3D adventure and use his incredible new abilities to collect Moons so you can power up your airship, the Odyssey, and rescue Princess Peach from Bowser's wedding plans! This sandbox-style 3D Mario adventure—the first since 1996's beloved Super Mario 64 and 2002's Nintendo GameCube classic Super Mario Sunshine—is packed with secrets and surprises, and with Mario's new moves like cap throw, cap jump, and capture, you'll have fun and exciting gameplay experiences unlike anything you've enjoyed in a Mario game before. Get ready to be whisked away to strange and amazing places far from the Mushroom Kingdom!"}
{"id":8,"name":"Super Mario Maker 2","age":"3","genre":"Platformer","review":"4.6/5","price":"£49.99","description":"Mario fans of the world, unite! Now you can play, create, and share* the side-scrolling Super Mario™ courses of your dreams in the Super Mario Maker™ 2 game, available exclusively on the Nintendo Switch™ system! Dive into the single-player Story Mode and play built-in courses to rebuild Princess Peach’s castle. Make your own courses, alone or together. And with a Nintendo Switch Online membership*, share your courses, access a near-endless supply made by others, enjoy online multiplayer, and more!"}
{"id":9,"name":"Minecraft","age":"7","genre":"Survival/Adventure","review":"4.1/5","price":"£29.99","description":"Explore randomly generated worlds and build amazing things from the simplest of homes to the grandest of castles. Play in creative mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armor to fend off the dangerous mobs."}
{"id":10,"name":"The Legend of Zelda: Link's Awakening","review":"5/5","age":"7","genre":"Action/Adventure","price":"£59.99","description":"As Link, you awaken in a strange land away from Hyrule, where animals talk and monsters roam. To uncover the truth behind your whereabouts and rouse the legendary Wind Fish, explore Koholint Island and all its trap-ridden dungeons, reimagined in stunning detail for this new release of one of the most beloved The Legend of Zelda games. Along the way, you’ll meet a hilarious assortment of charming characters to which you’ll never want to say goodbye"}
{"id":11,"name":"Super Mario Party","age":"3","genre":"Party Games","review":"4.8/5","price":"£39.99","description":"The original 4-player Mario Party series board game mode that fans love is back, and your friends and family are invited to the party! Freely walk the board: choose where to move, which Dice Block to roll, and how to win the most Stars in skill-based minigames. Wait till you see the 2 vs 2 mode with grid-based maps, the creative uses of the console, and the series’ first online minigame mode!"}
{"id":12,"name":"Luigi's Mansion","age":"7","genre":"Childish Horror","review":"4.6/5","price":"£59.99","description":"Luigi’s invited to the towering Last Resort hotel, but when Mario and friends go missing, our green-clad hero will have to conquer his fears to save them! Slam, blow away, and vacuum up ghosts with the all-new Poltergust G-00, and join forces with Gooigi to overcome the puzzling contraptions and mischievous boss on each themed floor. And that’s just the Last Resort. Enter the ScareScraper for 8-player local wireless or online co-op gameplay. "}
{"id":13,"name":"Stardew Valley","age":"3","genre":"Survival/Farming","review":"4/5","price":"£14.99","description":"You’ve inherited your grandfather’s old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won’t be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town’s most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness!"}
{"id":14,"name":"Untitled Goose Game","age":"3","genre":"Comedy","review":"5/5","price":"£19.99","description":"Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day."}
{"id":15,"name":"Human: Fall Flat","age":"12","genre":"Teamwork/Comedy","review":"4.2/5","price":"£7.49","description":"t's a gold prospector's dream come true in the frozen mountains of 'Thermal', the brand new gold-filled level for Human: Fall Flat. This Worldwide Workshop competition winning level sees players venture from snowy peaks to underground caverns in search of gold. You and up to seven online friends can interact with massive mining machines and manipulate rising air thermals to traverse giant caves. Or you may find the soft glow of the camp fire too comforting to leave behind."}
{"id":16,"name":"Super Mario Bros. U Deluxe","age":"3","genre":"Platformer","review":"4.5/5","price":"£39.99","description":"Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends* as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!"}