{"id":1,"name":"The Legend of Zelda: Breath of The Wild","title":"If you have a Nintendo Switch, go buy this game and finish it","rating":"5/5","body1":"It is super fun. It “rewards” and “punish” the player fairly. You start as this weak, amnesiac, and lost character and grows gradually to be knight who ambushes dozens of monsters right on their face. Everything has its consequences. Big swords are badass but slow and you can’t use your shield. Smaller swords are weaker but you can use your shield. Weapons break after several times of usage. Foods are there for reasonable and urgent sense. If you’re dumb enough to wear full metal armour in the middle of heavy rain, you’ll be struck by lightning.","body2":"","review1":"https://bit.ly/2SRhIb8","review2":"https://bit.ly/3cgvLio","review3":"https://bit.ly/2WEyLhZ"}
{"id":2,"name":"Animal Crossing: New Horizons","title":"A sweet, innocuous escape from reality","rating":"5/5","body1":"In New Horizons, you control a balloon-headed avatar of your own design, who is flown to a (practically) uninhabited island to begin a new life. On the island with you is Tom Nook, the tanuki-like businessman whom players will likely remember from previous Animal Crossing games. Tom Nook sets you up with a tent to live in, and teaches you the lay of the land – before you know it, he is providing you with a house, a list of chores, and a not-insignificant amount of debt.","body2":"New Horizons is a game best played in short spurts, especially at first, when the island is small and sparsely populated, and you find yourself limited by the number of things to do. After a week or so, the world starts to open up, and the game grows more compelling. Multiplayer features, both online and local, help flesh out the experience with an injection of places to go and critters to meet.","review1":"https://bit.ly/2WLSJHI","review2":"https://bit.ly/2SQhAZv","review3":"https://bit.ly/2SOS3jv"}
{"id":3,"name":"Smash Bros: Ultimate","title":"The fighting game with everything","rating":"5/5","body1":"There’s magic to the concept of the crossover, when strange worlds collide and wildly disparate characters meet, which Nintendo has often leveraged by bringing its various mascots together to engage in mortal combat (or occasionally go-karting). But Smash Bros Ultimate takes things to a maximalist extreme. In the 70-odd-strong fighter roster, Nintendo heroes such as Mario, Splatoon’s Inklings and Pikachu stand alongside outsiders such as Castlevania’s Simon Belmont and Final Fantasy’s Cloud. A palpable love of video games infuses everything, and tributes and references to their colourful history are omnipresent, from iconic and world-famous series to esoteric games that you thought nobody else even remembered.","body2":"Smash’s fairly basic goal – build up damage on opponents to launch them off the stage – belies the depth and complexity underneath. A match of Smash is the kind of thrilling, barely controlled chaos that feels like you’re dancing on quicksand. Spacing and positioning are paramount, as is the ability to predict an opponent’s next moves and movements. Couch multiplayer remains the most raucous and often hilarious of modes – shouts of “what just happened?” are not uncommon – but even when playing alone, the loop of split-second analysis followed by instantaneous action keeps you enthralled.","review1":"https://bit.ly/3dpLiwc","review2":"https://bit.ly/3ckuDKt","review3":"https://bit.ly/2WIcLm2"}
{"id":4,"name":"Splatoon 2","title":"Return of Nintendo's ink-spraying Squid Kids is a blast","rating":"4.1/5","body1":"Splatoon 2 gets so much right that it’s easy to ignore the occasional baffling ways in which Nintendo has failed to score into an open goal. Not least missing the chance to call the game “Spla2n”.","body2":"A sequel to 2015’s third-person multiplayer-focused Wii U-exclusive shooter, Splatoon 2 will be a wholly new experience for many: the Switch is already attracting converts who never picked up Nintendo’s previous machine, while the two biggest reasons to own a Switch to date – Mario Kart 8 and Breath of the Wild – are both already out on the Wii U.","review1":"https://bit.ly/2yG4S8T","review2":"https://bit.ly/3besa33","review3":"https://bit.ly/3fx963l"}
{"id":5,"name":"Pokemon Sword","title":"Close to being the very best","rating":"4/5","body1":"Sword and Shield bring the mainline Pokémon games onto the Nintendo Switch with a dollop of charm and a real sense of fun, as well as some much-needed gameplay optimizations. But not everything is picture perfect and while this new generation is close to being the very best (like no game ever was) there are some areas where it just falls short.","body2":"When it comes to charm, Pokémon Sword and Shield have it in spades. Whether you’re cooking a curry for your Pokémon around a campfire or being cheered outside Gyms by complete strangers who recognize you off the “telly”, these games go out of their way to warm you up, welcome you into their world and make you want to stay there.","review1":"https://bit.ly/3dAZyCJ","review2":"https://bit.ly/2WE7c8p","review3":"https://bit.ly/2SNNeaf"}
{"id":6,"name":"Mario Kart 8: Deluxe","title":"The best, most versatile game in the series","rating":"4/5","body1":"For those who skipped the Wii U, Mario Kart 8 introduced bigger tracks to accommodate 12 racers and vehicles that defy gravity to drive up walls and along ceilings, and sprout gliders to soar through the air. Those tracks all still look great on this new console, especially in portable mode. And Mario Kart 8 Deluxe also includes what was DLC for the Wii U version, like the wonderful Animal Crossing track that comes in four seasonal flavours, so there are 48 tracks in total.","body2":"Players can choose from 42 Nintendo-themed characters, including a few new ones like Inkling Girl and Inkling Boy from Splatoon, another game Nintendo will shortly bring across from the Wii U to the Switch. Unlike in Mario Kart 8 for the Wii U, all tracks and characters are available from the start; the only unlockable content is the various kart and bike parts – bodies, wheels, and gliders – that along with your chosen character’s weight class determine your stats: speed, acceleration, weight, handling and grip. Experienced players will need to spend some time with the game to earn the coins needed to unlock their preferred combinations for the perfect lap times.","review1":"https://bit.ly/2WeYtKN","review2":"https://bit.ly/3bjZk17","review3":"https://bit.ly/3dt95eU"}
{"id":7,"name":"Super Mario Odyssey","title":"A Perfect Game With One Problem","rating":"5/5","body1":"Super Mario Odyssey marks the first 3D Mario game since Super Mario 3D World in 2011, and arguably the most important Super Mario game since Nintendo used Super Mario 64 to bust the plumber into 3D and launch the N64 way back in 1996. It's the marquee title meant to show off the capabilities of the Nintendo Switch and redefine the classic series for an an entirely new era, which is no small feat considering how many times Nintendo has had to do that over the course of three decades. And they've done it -- they've done it in such a way that everything about Super Mario Odyssey feels as natural and obvious as rolling out of bed and as strange as a moon covered in low gravity rabbits; as familiar as jumping up into a question mark block and as wild as riding a stone lion through purple lava.","body2":"On an essential level, things look pretty similar to what we've seen before. Bowser has kidnapped Peach and is aiming to marry her, traveling across the world and collecting various wedding sundries along the way. Mario takes it upon himself to rectify that. I find myself hoping for a new plot, or maybe a slightly more proactive Peach, but these are the breaks. Odyssey follows a basic format established by Super Mario 64: Mario explores a series of open-ended worlds studded with jumping challenges, puzzles and the like, collecting rewards as he goes: in this case, we're hunting after Power Moons to charge up our ship and explore more worlds. We make our way through some familiar locations, or at least location styles. There's an ice world, there's a forest world, there's a desert world and there's a Luncheon world which, while charming, was obviously a fire world before Nintendo decided that wasn't weird enough.","review1":"https://bit.ly/3bhMwrZ","review2":"https://bit.ly/3bd4EDj","review3":"https://bit.ly/3dvJlyx"}
{"id":8,"name":"Super Mario Maker 2","title":"Whether you're building or not, this is a joy","rating":"4.6/5","body1":"Fireballs through pipes. That was my first idea. It was inspired by a level in Super Mario Maker 2's story mode in which I spawned a fire flower and then blitzed a room of Koopas by bouncing hot death through the pipes they had been using to travel around in and mess me up. When it was all over, I suddenly thought: what if you had a level, right, where Mario couldn't really move very much, but he had all these pipes which he could launch fireballs down? What if there was a way to have him sort of play this pipe organ of glorious Mario murder, cleaning out the level and perhaps bringing the exit straight to him at the end of it?","body2":"This is the first idea I have ever had for a Mario level. It's the first idea I've ever really had for anything, if I'm being honest. And the key is that it didn't come out of nowhere. The story mode in Mario Maker 2 - a wonderfully frothy collection of over 100 scattershot challenges that takes its cues, I gather, from a similar addition to the 3DS Mario Maker port - gave me the idea. It made me think about the possibilities inherent in the pieces of Mario without me even realising that's what I was doing. It gave me a prod in the right direction and I barely noticed it even as I started to move.","review1":"https://bit.ly/3fB72Hm","review2":"https://bit.ly/2yx3Dcf","review3":"https://bit.ly/3fELYQD"}
{"id":9,"name":"Minecraft","title":"Block Party","rating":"4.1/5","body1":"Minecraft is a game that needs no introduction; the quirky block building game has been a pop culture sensation for many years now, and has a port available on just about every modern platform one can name. Given the existence of Minecraft: Wii U Edition and the hybrid nature of the Switch, it was only a matter of time before Nintendo’s latest hardware received its own port of the classic. The big question is this: does Minecraft for the Switch make the game worth buying again? The answer is a resounding yes - the versatile nature of the Switch makes this an absolute must-buy.","body2":"If you’re one of the few who are looking for an explanation of exactly what Minecraft is, check out our review of the Wii U version, as this review will focus on what makes the Switch version stand apart. In a nutshell, Minecraft is a completely open-ended sandbox adventure game that allows you to either build whatever structures and projects you want out of an unlimited number of blocky materials, or to do your best to survive in a world that has a much more restricted amount of materials and rules. Either way you cut it, it can be quite dangerous starting a world in either mode, as it’s quite easy to get sucked into the charms of Minecraft and lose several hours to yet another lengthy session.","review1":"https://bit.ly/2WiGaob","review2":"https://bit.ly/3dz0UNZ","review3":"https://bit.ly/3dtbc29"}
{"id":10,"name":"The Legend of Zelda: Link's Awakening","title":"A dream come true","rating":"5/5","body1":"Koholint Island is a place worth treasuring. This is something Link learns over the course of his quest to wake the mythical Wind Fish. And it's something you will know already if you have played either version of Link's Awakening to date: the Game Boy original or its DX re-release for Game Boy Color. Koholint Island is as much a character in Link's adventure as its inhabitants, and not a square of its map is wasted. From the beach Link washes up on to the purple and white egg laying in wait on its highest peak, it is a meticulously-made puzzle wrapped up in the lives of those who dwell upon it.","body2":"Zelda has frequently dealt in melancholy, via locations on the brink of doom or left recovering from it generations later. On the surface, Link's Awakening is one of the series' most whimsical entries, its world inhabited by Super Mario enemies and talking animals, frogs who sing soul music and crocodile artists who paint pictures. But, from the off, it is also a location Link knows he must escape from - even if he doesn't yet know why. The melancholy here lies in every subsequent step, each bringing a greater familiarity and understanding of the places and people he must leave behind.","review1":"https://bit.ly/2LjPiCp","review2":"https://bit.ly/2YIoHai","review3":"https://bit.ly/3fztpx2"}
{"id":11,"name":"Super Mario Party","title":"Silly, slick and spotty return for Nintendo's madcap series","rating":"4.8/5","body1":" It's the 11th console entry in the series, so it's hardly Mario Party's first rodeo. But as the first for the Switch, the new game is also a chance for Nintendo to take the formula in a new direction. That much has been publicly promised, in fact - Nintendo is claiming that Super Mario Party represents a complete refresh of the series. And true to its word, Nintendo has certainly made the new game different. By combining elements of previous titles with new modes like River Survival and Sound Stage, this is most definitely a fresh take on the Mario Party formula.","body2":"Like most entries in the Mario Party series, if you're looking for a solid and dependable party game, this will absolutely do the job. The variety and silliness of the minigames is always a recipe for hilarity with friends, and Super Mario Party displays classic Nintendo charm. Yet despite the changes, some of the old Mario Party problems continue to linger, and it's unlikely to be a game you'll repeatedly return to in single-player mode. It does what it says on the tin, and does it well, but no more.","review1":"https://bit.ly/2LdtuIH","review2":"https://bit.ly/2SQ6tzJ","review3":"https://bit.ly/3fAoKen"}
{"id":12,"name":"Luigi's Mansion","title":"A hilarious, captivating ghost hunt","rating":"4.6/5","body1":"Luigi never seems to learn his lesson. It’s been 18 years since he was first lured to a haunted house and tortured by its spooky inhabitants. Now, having been duped again, he’s trapped in an even bleaker building – the Hotel of Last Resort – as he races to rescue a familiar cast of Mushroom Kingdom characters.","body2":"Although it treads very familiar ground to its predecessors, there’s a lot to love in the third instalment of the adventure series that lets Mario’s timid twin take charge. You still guide the character through uniquely themed sections of the building, relying on his flashlight and multi-functional Poltergust vacuum to rid the place of ghosts. Luigi keeps track of his progress through the 15 main hotel floors with the help of a digital assistant, amusingly called a Virtual Boo, as well as the quirky Professor E Gadd, who’s on hand to offer tips and tutorials.","review1":"https://bit.ly/2SPMKAc","review2":"https://bit.ly/2SNMMsz","review3":"https://bit.ly/3fsGtnX"}
{"id":13,"name":"Stardew Valley","title":"Stardew Valley is a fantastic achievement","rating":"4/5","body1":"Developed solely by Eric Barone, known as ConcernedApe, Stardew Valley is an embodiment of what one game developer can achieve through hard work, dedication and a lot of determination. For four years Barone didn't just program the game, but also created every sound effect, music track and piece of art. Inspired by the Harvest Moon series, now known as Story of Seasons, Barone wanted to create a game that not only paid homage to the series, but fix several problems he had with the series.","body2":"At times Stardew Valley can feel like a nostalgic trip, taking you back to the days of classic Harvest Moon games, like Back to Nature and A Wonderful Life, but Barone's desire to innovate always shines through. The multiplayer mode works fantastically well, allowing you to create a thriving farm, or simply chaos, with your friends. You can marry partners of the same sex, which, as a lesbian, I personally love - playing as a male character purely to romance the ladies gets boring after a while. Stardew Valley even manages to avoid becoming a repetitive slog, where you follow the same self-made routine day in, season out.","review1":"https://bit.ly/3dytxv1","review2":"https://bit.ly/2yJD4Az","review3":"https://bit.ly/2YOsRNY"}
{"id":14,"name":"Untitled Goose Game","title":"Never before have I felt so appalled by my virtual acts","rating":"5/5","body1":"The goose, a water bird with smooth white feathers, a long neck and compressed orange bill, is not an apex predator. Yet most of us have a memory, perhaps from childhood, probably involving a plastic bag of stale bread, when we were harangued by one of these quarrelsome birds who had seemingly woken up on the wrong side of the pond. We are used to playing as morally complex individuals in video games; even the heroes typically leave a genocidal trail of dead behind them. Never before, however, have I felt so appalled by my virtual acts as in Untitled Goose Game, which casts its player as a lone goose on a singular mission to victimise the residents of an English village via a thousand mundane, misery-making ways.","body2":"Untitled Goose Game began as a joke in an online chat room shared by the developers, a lavish sort of answer to the observation: “Man! What’s the deal with geese, eh?” The game quickly found an obsessed following on social media, thanks to a number of brilliantly funny clips showing a low-polygon goose being awful. What has elevated Untitled Goose Game above a simple, one-note gag (and from being any of the 10,000 poorer variations of how the idea might have turned out in less-able hands) is the finesse of its ideas and the precision of its observations. The goose waddles with exactly the authentic combination of conceit and threat, the comic waggle of its tail feathers juxtaposed with the menace of its rasping tongue. There’s a throb of joyful recognition when, having cowed a villager, you waddle away while issuing a belligerent farewell honk. Classic goose!","review1":"https://bit.ly/3dumao7","review2":"https://bit.ly/3fuyYNc","review3":"https://bit.ly/3fAoV9x"}
{"id":15,"name":"Human: Fall Flat","title":"The art of breaking a game","rating":"4.2/5","body1":"How often do you pay attention to recently deceased character models in games? Rarely, I presume. Unless it ends up in a humorous position it usually passes unnoticed. When a character dies and its body gets in a strange position, your experience is interrupted, as all immersion is broken – or sometimes it creates some of the funniest moments in gaming. Watching this phenomenon, some indie developers started to create experiences totally based on the possibility of playing around not only with ragdoll physics but also with game’s physics in general. Human: Fall Flat is one of these playgrounds, in which your worst enemy is the gravity itself.","body2":"This is a rule that becomes very clear from the game’s own menus: you see your colorless character ‘falling flat’ to the ground. Gravity will do its trick once again when you choose to start a new game or resume your last save. This time, though, your character will fall to the current level you’re in. From there, without a care in the world to anything that may sound like a narrative, you’ll have to play with the game’s physics, interacting with mechanisms, pushing objects, and trying to get any kind of dominance over the wonky controls that makes everything both funny and rage-inducting. You’ll do all that in order to get to the end of the level, and literally fall to the next one.","review1":"https://bit.ly/2WDfgq4","review2":"https://bit.ly/3du7Uf7","review3":"https://bit.ly/3fuMNvf"}
{"id":16,"name":"Super Mario Bros. U Deluxe","title":"A jump back to the basics","rating":"4.5/5","body1":"Recent Mario games have been wild and freewheeling, taking the little red plumber on galaxy-spanning trips and global tours, playing with the laws of physics as he jumps between planets or possesses weird creatures with his cap. But New Super Mario Bros is more like the simpler Mario adventures remembered from an early-90s childhood. It has straightforward left-to-right levels set in castles, underwater, on top of giant mushrooms or in the clouds. A loopy overworld connects them all together, offering a couple of different routes through each themed world. You run, you jump, you try not to die. And in multiplayer, where four of you can leap around dementedly together, you help each other out.","body2":"But, though the running, jumping, Goomba-stomping and coin-collecting is fun, and the madcap landscapes that you tumble through are endearingly weird, the magic that animates Mario’s best adventures is missing. The music doesn’t stick around in your head for hours after you stop playing. It looks colourful, but oddly flat. After the joyfully creative Super Mario Odyssey, a game that anyone with a Nintendo Switch should own, it’s an unwelcome surprise to play a Mario game that doesn’t immediately floor you with its charm.","review1":"https://bit.ly/2SRPfSN","review2":"https://bit.ly/3fydS0A","review3":"https://bit.ly/2WJSywg"}